tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "laishulu/homebrew"
tap "nats-io/nats-tools"
tap "sxzz/brew"

brew "act"
brew "ansible"
brew "antidote"
brew "ast-grep"
brew "awscli"
brew "bat"
brew "btop"
brew "caddy"
brew "cloudflared"
brew "cmake"
brew "coreutils"
brew "curl"
brew "docker"
brew "doggo"
brew "duckdb"
brew "fastfetch"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "gitui"
brew "go"
brew "helm"
brew "htop"
brew "huggingface-cli"
brew "imagemagick"
brew "iredis"
brew "kubernetes-cli"
brew "lego"
brew "lf"
brew "lsd"
brew "marp-cli"
brew "mtr"
brew "n"
brew "ncdu"
brew "onefetch"
brew "optipng"
brew "pgformatter"
brew "pkgconf"
brew "pngquant"
brew "protobuf"
brew "python@3.11"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "sentencepiece"
brew "smartmontools"
brew "starship"
brew "stow"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "websocat"
brew "wget"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "laishulu/homebrew/macism"
brew "nats-io/nats-tools/nats"

cask "1password"
cask "alacritty"
cask "alt-tab"
cask "android-studio"
cask "bilibili"
cask "dbeaver-community"
cask "discord"
cask "feishu"
cask "figma"
cask "ghostty"
cask "google-chrome"
cask "google-chrome@beta"
cask "hammerspoon"
cask "iina"
cask "itsycal"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keepingyouawake"
cask "lark"
cask "linearmouse"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "monitorcontrol"
cask "notion"
cask "openvpn-connect"
cask "orbstack"
cask "qbittorrent"
cask "rapidapi"
cask "raycast"
cask "redis-insight"
cask "squirrel-app"
cask "tailscale-app"
cask "typeless"
cask "visual-studio-code"
cask "wechat"
cask "wechatwebdevtools"
cask "zed"
