tap "homebrew/bundle"
brew "python@3.11"
brew "ansible"
brew "curl"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gitui"
brew "go"
brew "htop"
brew "lf"
brew "mtr"
brew "n"
brew "neofetch"
brew "neovim"
brew "orbstack"
brew "pgformatter"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "v2ray"
brew "vim"
brew "wget"
cask "1password"
cask "alacritty"
cask "alt-tab"
cask "barrier"
cask "bilibili"
cask "dbeaver-community"
cask "google-chrome"
cask "hiddenbar"
cask "iina"
cask "itsycal"
cask "karabiner-elements"
cask "linearmouse"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "notion"
cask "openvpn-connect"
cask "rapidapi"
cask "slack"
cask "squirrel"
cask "tailscale"
cask "visual-studio-code"
cask "wechat"
cask "wechatwork"
cask "zoom"
cask "skype"
